問1:JavaScriptの書き方ルールを3ついえ。

問2:データの型を3ついえ。



問3:次の四則演算を行い、計算結果をコンソールでに出力せよ。
45に18を足す
30から12を引く
15に6を掛ける
30を3で割る
45を8で割ったあまりを求める。


問4:次のデータを連結してコンソールに出力せよ。
・文字列型のデータとして45と18を出力せよ
・「今日の天気は」と「晴れ」を連結して出力せよ
・「今日の天気は」と「曇り」を連結して出力せよ





正解1:
・大文字と小文字は区別する
・文末にセミコロンをつける
・1行コメントは行頭に//、複数行コメントは/*と*/で囲む



正解2:
文字列型  'こんにちは' 「''」「" "」で囲む
数字型    55
論理型    true / false



正解3:
console.log(45 + 18);
console.log(30 - 12);
console.log(15 * 6);
console.log(30 / 3);
console.log(45 % 8);

正解3:
console.log('45' + '18');
console.log('今日の天気は' + '晴れ');
console.log('今日の天気は' + '曇り');